Revit 2026 API

# Transform1D Properties

---

The Transform1D type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Determinant | The determinant of this transformation. |
|  | IsIdentity | The boolean value that indicates whether this transformation is an identity. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Scale | The real number that represents the scale of this transformation. |
|  | Translation | The translational part of this transformation. |

#### Reference

Transform1D Class

Autodesk.Revit.DB Namespace